adnatBackend/challenge/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def current_user
        if session[:user_id]
            @currecnt_user ||=User.find(session[:user_id])