adnatBackend/challenge/app/controllers/organizations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "organizations" ("name", "hourlyrate", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1"], ["hourlyrate", 5.0], ["user_id", 6], ["created_at", "2020-09-16 17:29:16.708665"], ["updated_at", "2020-09-16 17:29:16.708665"]]
---
    def create
        @user = User.find(params[:user_id])
        @organization = @user.organizations.create(organization_params)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def edit
        @organization = Organization.find(params[:user_id])
        @user = User.find(params[:id])

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "organizations" SET "hourlyrate" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["hourlyrate", 5.3], ["updated_at", "2020-09-17 16:10:26.870901"], ["id", 1]]
---
    def update
        @organization = Organization.find(params[:user_id])
        @user = User.find(params[:id])

        if @organization.update(organization_params)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "organizations" WHERE "organizations"."id" = ?  [["id", 4]]
---
    def destroy
        @organization = Organization.find(params[:user_id])
        @user = User.find(params[:id])

        @organization.destroy