adnatBackend/challenge/app/controllers/organizations_controller.rb

    def leave
        @organization = Organization.find(params[:organization_id])
        @user = current_user
        @organization.user = nil
        if @organization.save!
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "organizations" SET "user_id" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["user_id", nil], ["updated_at", "2020-09-25 20:02:35.310823"], ["id", 2]]