adnatBackend/challenge/app/controllers/shifts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def new
        @user = User.find(params[:user_id])
        @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "shifts" ("start", "finish", "breaklength", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["start", "2020-09-17 21:10:00"], ["finish", "2020-09-17 21:15:00"], ["breaklength", 1], ["user_id", 13], ["created_at", "2020-09-17 21:11:07.259987"], ["updated_at", "2020-09-17 21:11:07.259987"]]
---
    def create
        @user = User.find(params[:user_id])
        shiftData = params[:shift]
        start = DateTime.new shiftData["date(1i)"].to_i, shiftData["date(2i)"].to_i, shiftData["date(3i)"].to_i, shiftData["start(4i)"].to_i, shiftData["start(5i)"].to_i
        finish = DateTime.new shiftData["date(1i)"].to_i, shiftData["date(2i)"].to_i, shiftData["date(3i)"].to_i, shiftData["finish(4i)"].to_i, shiftData["finish(5i)"].to_i
        params[:shift]["start"] = start
        params[:shift]["finish"] = finish
        @shift = @user.shifts.create(shift_params)