adnatBackend/challenge/app/views/users/index.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."user_id" = ?  [["user_id", 2]]
---
      </tr>
      <% user.organizations.each do |organization| %>