adnatBackend/challenge/app/views/users/show.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."user_id" = ?  [["user_id", 13]]
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."user_id" = ?  [["user_id", 7]]
---

<% if @user.organizations.count > 0 %>
  <%= @user.organizations.each do |organization| %>

SELECT "organizations".* FROM "organizations" WHERE "organizations"."user_id" = ?  [["user_id", 6]]
---
  <% @users.each do |user| %>
    <% user.organizations.each do |organization| %>