adnatBackend/challenge/app/views/shifts/new.html.erb

    <% @users.each do |user| %>
      <% user.shifts.each do |shift| %>
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."user_id" = ?  [["user_id", 6]]

          <td style="border: 1px solid black">
            <% user.organizations.each do |organization| %>
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."user_id" = ?  [["user_id", 13]]